# RbsElecLoadsummaryConnectedCurrentParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsElecLoadsummaryConnectedCurrentParam Property
ParameterTypeId Class See Also
---
"Connected Current"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsElecLoadsummaryConnectedCurrentParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsElecLoadsummaryConnectedCurrentParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsElecLoadsummaryConnectedCurrentParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace